import 'package:flutter/material.dart';

class Educational extends StatelessWidget {
  const Educational({Key key}) : super(key: key);
  static final String id = 'educational';


  @override
  Widget build(BuildContext context) {
    List quotes = [
    "(১) “ অপেক্ষা হলো শুদ্ধতম ভালোবাসার একটি চিহ্ন। সবাই ভালোবাসি বলতে পারে। কিন্তু সবাই অপেক্ষা করে সেই ভালোবাসা প্রমাণ করতে পারে না। - হুমায়ূন আহমেদ  ”", 
    "(২) “ জীবনে কিছু কিছু প্রশ্ন থাকে যার উত্তর কখনও মিলেনা, কিছু কিছু ভুল থাকে যা শোধরানো যায়না, আর কিছু কিছু কষ্ট থাকে যা কাউকে বলা যায়না - হুমায়ূন আহমেদ ”", 
    "(৩) ” একা থাকার এই ভালো লাগায় হারিয়ে গিয়েছি, নিঃসঙ্গতা আমাকে আর পাবে না - রুদ্র মুহাম্মদ শহীদুল্লাহ ”", 
    "(৪) ” তোমারে যে চাহিয়াছে ভুলে একদিন, সে জানে তোমারে ভোলা কি কঠিন - কাজী নজরুল ইসলাম”",
    "(৫) ” যতক্ষণ পর্যন্ত আমার দেশের একটি কুকুরও ক্ষুধার্ত, আমার সমগ্র ধর্মকে একে খাওয়াতে হবে এবং এর সেবা করতে হবে, তা না করে অন্য যাই করা হোক না কেন তার সবই অধার্মিক - স্বামী বিবেকানন্দ ”", 
    "(৬) ” মানুষ মরে গেলে পচে যায়, বেঁচে থাকলে বদলায়, কারণে-অকারণে বদলায় - মুনীর চৌধুরী ”",
    "(৭) ” বোকা মানুষ গুলো হয়তো অন্যকে বিরক্ত করতে জানে। কিন্তু কখনও কাউকে ঠকাতে জানে না। - হুমায়ূন আহমেদ”", 
    "(৮) ” জীবন ও মৃত্যু একটা ব্যাপারেরই বিভিন্ন নাম মাত্র। একই টাকার এপিঠ ওপিঠ। উভয়েই মায়া। এ অবস্থাটাকে পরিস্কার করে বোঝাবার জো নেই। একসময় বাঁচাবার চেষ্টা হচ্ছে আবার পর মুহর্তেই বিনাশা বা মৃত্যু চেষ্টা। - স্বামী বিবেকানন্দ ”",
    "(৯) ” সব কিছুকেই একটি নির্দিষ্ট সংজ্ঞায় সংজ্ঞায়িত করা যায়, কিন্তু কষ্টকে কোন নির্দিষ্ট সঙ্গায় ফেলা যায় না। কারন কষ্ট এমন এক জিনিস যা ব্যক্তি থেকে ব্যক্তি ভিন্ন হয় - রেদোয়ান মাসুদ ”",
    "(১০) ” এতোটা নিশব্দে জেগে থাকা যায় না, তবু জেগে আছি.... আরো কতো শব্দহীন হাঁটবে তুমি, আরো কতো নিভৃত চরনে আমি কি কিছুই শুনবো না- আমি কি কিছুই জানবো না! - রুদ্র মুহাম্মদ শহীদুল্লাহ”",
    ];


    return Scaffold(
      appBar: AppBar(
        title: Text("বাণী চিরন্তণী",style: TextStyle(
              fontSize: 22.0,
              fontWeight: FontWeight.w200,
              color: Colors.white,
              fontFamily: 'Galada'
            ),),
        
      ),

      body: Container(
        color: Colors.lime[50],
        padding: EdgeInsets.all(10.0),
        child:ListView.builder(
          itemCount: 10,
          itemBuilder: (BuildContext context, int index) => Container(
            padding: EdgeInsets.all(10.0),
            child: Text(quotes[index], style: TextStyle(
              fontSize: 18.0,
              fontWeight: FontWeight.normal,
              color: Colors.black,
              fontFamily: 'Galada'
            ),),

          ),
        )
      ),
    );
  }
}