import 'package:flutter/material.dart';

class Inspirational extends StatelessWidget {
  const Inspirational({Key key}) : super(key: key);
  static final String id = 'inspirational';


  @override
  Widget build(BuildContext context) {
    List quotes = [
    "(১) “ আমেরিকায় এক গবেষণায় দেখা গেছে: বেকারদের খেলা: বাস্কেটবল। শ্রমিকদের খেলা: ফুটবল। ফোরম্যানদের খেলা: বেসবল। ম্যানেজারদের খেলা: টেনিস। সিইওদের খেলা: গলফ। সিদ্ধান্ত: কর্পোরেট কাঠামোতে যে যত উঁচুতে, তার বল তত ছোট ”", 
    "(২) “ ওমর সানী আর মৌসূমী ট্রেনে করে যাচ্ছে, তাদের সাথে একজন বৃদ্ধও ছিল। মৌসূমী-আমার গালে ব্যাথা করতেছে ওমর-আমি চুমু দিলেই ঠিক হয়ে যাবে তখন বুডো লোকটি বলে ঊঠল–বাবা আমি বড় কষ্টে আছি, তুমি কি পাইলসের চিকিৎসা কর? ”", 
    "(৩) ” এক কিপ্টে লোক ডাক্তার এর কাছে গেল ইউরিন টেস্টের জন্য | টেস্ট শেষ করে সে তার ইউরিনের বোতল তা সাথে নিয়ে বাসাইয় চলে এল,তখন তার স্ত্রী এইটা দেখে অবাক হয়ে বলল,সে কি? তুমি এইটা নিয়ে এলে কেন???লোকের জবাব, ডাক্তার বলেছে আমার ইউরিনে নাকি সুগার আছে,এখন চিনির যে দাম,তাই এইটা সাথে করে নিয়ে এলাম | ”", 
    "(৪) ” :কী নিয়ে রাস্তায় ঝগড়া করছ তোমরা? : একটা কুকুর ছানা নিয়ে, স্যার। আমরা স্থির করেছি, যে সবচেয়ে মজাদার মিথ্যা বলতে পারবে, কুকুর ছানাটা তারই হবে। : বলিস কী! তোদের মতো.. বয়সে মিথ্যা কাকে বলে তো আমরা জানতামই না। : তা হলে কুকুর ছানাটা আপনিই পেলেন, স্যার।”",
    "(৫) ” দুই পিচ্চির কথা হচ্ছে…১ম পিচ্চি: জানিস, কাল রাতে স্বপ্নে দেখি আমি ফায়ার সার্ভিসে চাকরি পাইছি এবং এক বাসায় আগুন নিভাইতাছি । দ্বিতীয় পিচ্চি: WOW!! দারুন তো তার পর কি হল দোস্ত?? ১ম পিচ্চি: কি আর হবে, ঘুম থেকে উঠে দেখি কাম শেষ!! দ্বিতীয় পিচ্চি: কেনরে, কি হইছিল?? ১ম পিচ্চি: আর বলিস না, দেখি…..মুইতা বিছানা ভাসাই দিছি!!!”", 
    "(৬) ” একটি পাগলা গারদে সব পাগল নাচানাচি করছিল.. শুধু একজন পাগল বসে ছিল… ডাক্টার ভাবল সেই পাগলটা মনে হয় ভাল হয়ে গেছে । তাই তাকে জিগ্গেস করা হল সবাই নাচছে তুমি নাচছ না কেন? উত্তরে পাগলটি বলল… ” আরে গাঁধাঁ বিয়ে বাড়ীতে কি জামাই কখনো নাচে…. পল্টু: এখনে চুল কাটাতে কত লাগে? নাপিত: ৪০ টাকা! পল্টু: আর সেভ করতে কত লাগে? নাপিত: ২০ টাকা! পল্টু: আমার মাথাটা একটু সেভ করে দিন ”",
    "(৭) ” সাগরের মাঝখানে লেবু গাছ: শিক্ষক : মনে করো সাগরের মাঝখানে একটা লেবু গাছ। তুমি কীভাবে লেবু পেড়ে আনবে? বনি : পাখি হয়ে স্যার! শিক্ষক : মানুষকে পাখি বানাইবো কি তোর বাপ? বনি : সাগরের মাঝখানে লেবু গাছ লাগাইবো কি আপনার বাপ?”", 
    "(৮) ” তুমি কাকে বাঁচাবে? শিক্ষক : যদি পুকুরে তোমার ফ্রেন্ড আর গার্লফ্রেন্ড ডুবতে থাকে, তবে তুমি কাকে বাঁচাবে? ছাত্র : দু’জনকেই ডুবতে দিন। স্যার : সে কী, কেন? ছাত্র : আরে, ওরা একসাথে পুকুরে কী করছিল?”",
    "(৯) ” তোর ভাবির সাথে একদিন হাবলু হঠাৎ তার ভাবিকে ধরে প্রচুর মারধর করতে লাগল! সবাই অবাক হয়ে হাবলুকে থামালো আর জিজ্ঞেস করল- প্রতিবেশী : তুমি তোমার ভাবিকে মারছ কেন? হাবলু : আমার ভাবি ভালো মহিলা না! প্রতিবেশী : তুমি কীভাবে বুঝলা? হাবলু : আর বইলেন না! আমি আমার যেই বন্ধুকেই ফোনে কথা বলতে দেখে জিজ্ঞেস করি, কার সাথে কথা বলিস? সেই বন্ধুই উত্তর দেয়, তোর ভাবির সাথে! ”",
    "(১০) ” ওটা লন্ড্রির দোকান এক লোকের স্ত্রী বেড়াতে এসে এক জায়গায় একটা সাইনবোর্ড দেখল। তাতে লেখা- ‘বিশাল মূল্য ছাড়। সিল্কের শাড়ি ১০ টাকা, জামদানি ৮ টাকা ও সুতি শাড়ি ৫ টাকা’ দেখে সে তার স্বামীকে বলল- স্ত্রী : দেখো জান, কী বিশাল ডিসকাউন্ট, অবিশ্বাস্য। এখনই আমাকে ৩০০ টাকা দাও। ইচ্ছেমতো শাড়ি কিনে আনি। স্বামী : এতো উত্তেজিত হওয়ার কিছু নেই। ওটা লন্ড্রির দোকান।”",
    ];


    return Scaffold(
      appBar: AppBar(
        title: Text("মজার জোকস",style: TextStyle(
              fontSize: 22.0,
              fontWeight: FontWeight.w200,
              color: Colors.white,
              fontFamily: 'Galada'
            ),),
        
      ),

      body: Container(
        color: Colors.lime[50],
        padding: EdgeInsets.all(10.0),
        child:ListView.builder(
          itemCount: 10,
          itemBuilder: (BuildContext context, int index) => Container(
            padding: EdgeInsets.all(10.0),
            child: Text(quotes[index], style: TextStyle(
              fontSize: 18.0,
              fontWeight: FontWeight.normal,
              color: Colors.black,
              fontFamily: 'Galada'
            ),),

          ),
        )
      ),
    );
  }
}